### Project examining All-Time Olympic Medal counts
#### by Erika Harrell

In [1]:
# importing Python libraries
import requests 
import pandas as pd
from bs4 import BeautifulSoup
from io import StringIO
import numpy as np
import matplotlib.pyplot as plt
import plotly.express as px
import regex as re
from geopy.geocoders import Nominatim
#facilitate showing graphs when exporting notebook to HTML
import plotly.io as pio
pio.renderers.default="notebook"
#show all output in each cell
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

In [2]:
#scraping Wikipedia page
url = "https://en.wikipedia.org/wiki/All-time_Olympic_Games_medal_table"
#making GET request to get information (raw HTML info) from server using URL
response = requests.get(url)
#using BeautifulSoup's HTML parser over the raw HTML content to create a BeautifulSoup object
soup = BeautifulSoup(response.content, "html.parser")
#finding all text in BeautifulSoup object with table HTML tag
tables = soup.find_all("table")
#getting the second element of tables wihch is the first table on the Wikipedia page and
#use pandas read_html command to read it in
#have to wrap string version of table in StringIO command because read_html does not take string values directly
df1 = pd.read_html(StringIO(str(tables[1])))
# printing table
print(df1)

[                                            Team Summer Olympic Games  \
                                 Team (IOC code)                  No.
0                              Afghanistan (AFG)                   16
1                                  Albania (ALB)                   10
2                                  Algeria (ALG)                   15
3                                Argentina (ARG)                   26
4                                  Armenia (ARM)                    8
..                                           ...                  ...
158       Individual Neutral Athletes (AIN)[AIN]                    1
159      Independent Olympic Athletes (IOA)[IOA]                    3
160  Independent Olympic Participants (IOP)[IOP]                    1
161                        Mixed team (ZZX)[ZZX]                    3
162                                       Totals                   30

                                                              \
    Unnamed: 2_level_1 Unnamed: 3_level_1 Unnamed: 4_level_1
0                    0                  0                  2
1                    0                  0                  2
2                    7                  4                  9
3                   22                 27                 31
4                    2                 11                  9
..                 ...                ...                ...
158                  1                  3                  1
159                  1                  0                  1
160                  0                  1                  2
161                 11                  6                  8
162               5789               5759               6277

                       Winter Olympic Games                     \
    Unnamed: 5_level_1                  No. Unnamed: 7_level_1
0                    2                    0                  0
1                    2                    5                  0
2                   20                    3                  0
3                   80                   20                  0
4                   22                    8                  0
..                 ...                  ...                ...
158                  1                    0                  0
159                  2                    0                  0
160                  3                    0                  0
161                 25                    0                  0
162              17825                   24               1171

                                                              Combined total  \
    Unnamed: 8_level_1 Unnamed: 9_level_1 Unnamed: 10_level_1            No.
0                    0                  0                   0             16
1                    0                  0                   0             15
2                    0                  0                   0             18
3                    0                  0                   0             46
4                    0                  0                   0             16
..                 ...                ...                 ...            ...
158                  0                  0                   0              1
159                  0                  0                   0              3
160                  0                  0                   0              1
161                  0                  0                   0              3
162               1169               1160                3500             54

                                                                 \
    Unnamed: 12_level_1 Unnamed: 13_level_1 Unnamed: 14_level_1
0                     0                   0                   2
1                     0                   0                   2
2                     7                   4                   9
3                    22                  27                  31
4                     2                  11                   9
..                  ...                 ...                 ...
158                   1                   3                   1
159                   1                   0                   1
160                   0                   1                   2
161                  11                   6                   8
162                6960                6928                7437


    Unnamed: 15_level_1
0                     2
1                     2
2                    20
3                    80
4                    22
..                  ...
158                   5
159                   2
160                   3
161                  25
162               21325

[163 rows x 16 columns]]

In [3]:
#get information about df1
#get type of df1
type(df1)
#get length of df1 list
len(df1)
#get type of first element of df1
type(df1[0])

list

1

pandas.core.frame.DataFrame

In [4]:
#get dataframe out of list
df = df1[0]
type(df)

pandas.core.frame.DataFrame

In [5]:
# get information about dataframe
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 163 entries, 0 to 162
Data columns (total 16 columns):
 #   Column                                       Non-Null Count  Dtype
---  ------                                       --------------  -----
 0   (Team, Team (IOC code))                      163 non-null    object
 1   (Summer Olympic Games, No.)                  163 non-null    int64
 2   (Summer Olympic Games, Unnamed: 2_level_1)   163 non-null    int64
 3   (Summer Olympic Games, Unnamed: 3_level_1)   163 non-null    int64
 4   (Summer Olympic Games, Unnamed: 4_level_1)   163 non-null    int64
 5   (Summer Olympic Games, Unnamed: 5_level_1)   163 non-null    int64
 6   (Winter Olympic Games, No.)                  163 non-null    int64
 7   (Winter Olympic Games, Unnamed: 7_level_1)   163 non-null    int64
 8   (Winter Olympic Games, Unnamed: 8_level_1)   163 non-null    int64
 9   (Winter Olympic Games, Unnamed: 9_level_1)   163 non-null    int64
 10  (Winter Olympic Games, Unnamed: 10_level_1)  163 non-null    int64
 11  (Combined total, No.)                        163 non-null    int64
 12  (Combined total, Unnamed: 12_level_1)        163 non-null    int64
 13  (Combined total, Unnamed: 13_level_1)        163 non-null    int64
 14  (Combined total, Unnamed: 14_level_1)        163 non-null    int64
 15  (Combined total, Unnamed: 15_level_1)        163 non-null    int64
dtypes: int64(15), object(1)
memory usage: 20.5+ KB

In [6]:
# dropping the last row of the dataframe
df = df.iloc[:-1]
print(df)

                                            Team Summer Olympic Games  \
                                 Team (IOC code)                  No.
0                              Afghanistan (AFG)                   16
1                                  Albania (ALB)                   10
2                                  Algeria (ALG)                   15
3                                Argentina (ARG)                   26
4                                  Armenia (ARM)                    8
..                                           ...                  ...
157                          Zimbabwe (ZIM)[ZIM]                   15
158       Individual Neutral Athletes (AIN)[AIN]                    1
159      Independent Olympic Athletes (IOA)[IOA]                    3
160  Independent Olympic Participants (IOP)[IOP]                    1
161                        Mixed team (ZZX)[ZZX]                    3

                                                              \
    Unnamed: 2_level_1 Unnamed: 3_level_1 Unnamed: 4_level_1
0                    0                  0                  2
1                    0                  0                  2
2                    7                  4                  9
3                   22                 27                 31
4                    2                 11                  9
..                 ...                ...                ...
157                  3                  4                  1
158                  1                  3                  1
159                  1                  0                  1
160                  0                  1                  2
161                 11                  6                  8

                       Winter Olympic Games                     \
    Unnamed: 5_level_1                  No. Unnamed: 7_level_1
0                    2                    0                  0
1                    2                    5                  0
2                   20                    3                  0
3                   80                   20                  0
4                   22                    8                  0
..                 ...                  ...                ...
157                  8                    1                  0
158                  1                    0                  0
159                  2                    0                  0
160                  3                    0                  0
161                 25                    0                  0

                                                              Combined total  \
    Unnamed: 8_level_1 Unnamed: 9_level_1 Unnamed: 10_level_1            No.
0                    0                  0                   0             16
1                    0                  0                   0             15
2                    0                  0                   0             18
3                    0                  0                   0             46
4                    0                  0                   0             16
..                 ...                ...                 ...            ...
157                  0                  0                   0             16
158                  0                  0                   0              1
159                  0                  0                   0              3
160                  0                  0                   0              1
161                  0                  0                   0              3

                                                                 \
    Unnamed: 12_level_1 Unnamed: 13_level_1 Unnamed: 14_level_1
0                     0                   0                   2
1                     0                   0                   2
2                     7                   4                   9
3                    22                  27                  31
4                     2                  11                   9
..                  ...                 ...                 ...
157                   3                   4                   1
158                   1                   3                   1
159                   1                   0                   1
160                   0                   1                   2
161                  11                   6                   8


    Unnamed: 15_level_1
0                     2
1                     2
2                    20
3                    80
4                    22
..                  ...
157                   8
158                   5
159                   2
160                   3
161                  25

[162 rows x 16 columns]

In [7]:
# get column names of dataframe
df.columns
# get number of columns
len(df.columns)

MultiIndex([(                'Team',     'Team (IOC code)'),
            ('Summer Olympic Games',                 'No.'),
            ('Summer Olympic Games',  'Unnamed: 2_level_1'),
            ('Summer Olympic Games',  'Unnamed: 3_level_1'),
            ('Summer Olympic Games',  'Unnamed: 4_level_1'),
            ('Summer Olympic Games',  'Unnamed: 5_level_1'),
            ('Winter Olympic Games',                 'No.'),
            ('Winter Olympic Games',  'Unnamed: 7_level_1'),
            ('Winter Olympic Games',  'Unnamed: 8_level_1'),
            ('Winter Olympic Games',  'Unnamed: 9_level_1'),
            ('Winter Olympic Games', 'Unnamed: 10_level_1'),
            (      'Combined total',                 'No.'),
            (      'Combined total', 'Unnamed: 12_level_1'),
            (      'Combined total', 'Unnamed: 13_level_1'),
            (      'Combined total', 'Unnamed: 14_level_1'),
            (      'Combined total', 'Unnamed: 15_level_1')],
           )

16

In [8]:
#examining columns
#first row of dataframe
df.head(1)
#getting type of upper level columns
print(type(df['Team']))
print(type(df['Summer Olympic Games']))
print(type(df['Winter Olympic Games']))
print(type(df['Combined total']))

                Team Summer Olympic Games                     \
     Team (IOC code)                  No. Unnamed: 2_level_1
0  Afghanistan (AFG)                   16                  0

                                                            \
  Unnamed: 3_level_1 Unnamed: 4_level_1 Unnamed: 5_level_1
0                  0                  2                  2

  Winter Olympic Games                                        \
                   No. Unnamed: 7_level_1 Unnamed: 8_level_1
0                    0                  0                  0

                                         Combined total                      \
  Unnamed: 9_level_1 Unnamed: 10_level_1            No. Unnamed: 12_level_1
0                  0                   0             16                   0


  Unnamed: 13_level_1 Unnamed: 14_level_1 Unnamed: 15_level_1
0                   0                   2                   2

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.frame.DataFrame'>

In [9]:
#creating new dataframe from nested dataframes in df
#working with Teams data frame
df1 = df['Team']
#get type of df1
type(df1)
#get name of first column of df1
df1.columns[0]
# get number of rows and columns
df1.shape
#get first row of df1
df1.head(1)
#creating variable with Team name only by splitting Team (IOC code) variable
v1 = df1['Team (IOC code)'].str.split("(", expand=True)[0].to_frame()
#creating separate IOC code variable only by splitting Team (IOC code) variable
v2 = df1['Team (IOC code)'].str.split("(", expand=True)[1].to_frame()
#adding Team and IOC code variables to df1
df1 = pd.concat([df1,v1, v2], axis=1)
#look at first 5 rows of df1
df1.head()

pandas.core.frame.DataFrame

'Team (IOC code)'

(162, 1)

     Team (IOC code)
0  Afghanistan (AFG)

     Team (IOC code)             0     1
0  Afghanistan (AFG)  Afghanistan   AFG)
1      Albania (ALB)      Albania   ALB)
2      Algeria (ALG)      Algeria   ALG)
3    Argentina (ARG)    Argentina   ARG)
4      Armenia (ARM)      Armenia   ARM)

In [10]:
#clean up new columns
#get column names of df1
df1.columns
#rename 0 and 1 columns in df1
df1.rename(columns={0 : 'Team', 1 : 'IOCcode'}, inplace = True)
#check head of df1
df1.head()

Index(['Team (IOC code)', 0, 1], dtype='object')

     Team (IOC code)          Team IOCcode
0  Afghanistan (AFG)  Afghanistan     AFG)
1      Albania (ALB)      Albania     ALB)
2      Algeria (ALG)      Algeria     ALG)
3    Argentina (ARG)    Argentina     ARG)
4      Armenia (ARM)      Armenia     ARM)

In [11]:
#check IOCcode column values
df1['IOCcode'].unique()
#drop extra text from IOC code column
df1['IOCcode'] = df1['IOCcode'].str.replace(')', '')
#check values on IOCcode
df1['IOCcode'].unique()

array(['AFG)', 'ALB)', 'ALG)', 'ARG)', 'ARM)', 'ANZ)[ANZ]',
       'AUS)[AUS][Z]', 'AUT)', 'AZE)', 'BAH)', 'BRN)', 'BAR)[BAR]',
       'BLR)', 'BEL)', 'BER)', 'BOH)[BOH][Z]', 'BOT)', 'BRA)',
       'BWI)[BWI]', 'BUL)[H]', 'BUR)', 'BDI)', 'CMR)', 'CAN)', 'CPV)',
       'CHI)[I]', 'CHN)[CHN]', 'COL)', 'CRC)', 'CIV)[CIV]', 'CRO)',
       'CUB)[Z]', 'CYP)', 'CZE)[CZE]', 'TCH)[TCH]', 'DEN)[Z]', 'DJI)[B]',
       'DMA)', 'DOM)', 'ECU)', 'EGY)[EGY][Z]', 'ERI)', 'EST)', 'ETH)',
       'FIJ)', 'FIN)', 'FRA)[O][P][Z]', 'GAB)', 'GEO)', 'GER)[GER] [Z]',
       'EUA)[EUA]', 'GDR)[GDR]', 'FRG)[FRG]', 'GHA)[GHA]', 'GBR)[GBR][Z]',
       'GRE)', 'GRN)', 'GUA)', 'GUY)[GUY]', 'HAI)[J]', 'HKG)[HKG]',
       'HUN)', 'ISL)', 'IND)[F]', 'INA)', 'IRI)[K]', 'IRQ)', 'IRL)',
       'ISR)', 'ITA)[M][S]', 'JAM)[JAM]', 'JPN)', 'JOR)', 'KAZ)', 'KEN)',
       'KOS)', 'PRK)', 'KOR)', 'KUW)', 'KGZ)', 'LAT)', 'LBN)', 'LIE)',
       'LTU)', 'LUX)[O]', 'MAS)[MAS]', 'MRI)', 'MEX)', 'MDA)', 'MGL)',
       'MNE)', 'MAR)', 'MOZ)', 'NAM)', 'NED)[Z]', 'AHO)[AHO][I]',
       'NZL)[NZL]', 'NIG)', 'NGR)', 'MKD)', 'NOR)[Q]', 'PAK)', 'PAN)',
       'PAR)', 'PER)[L]', 'PHI)', 'POL)', 'POR)', 'PUR)', 'QAT)', 'EOR)',
       'ROU)', 'RUS)[RUS]', 'RU1)[RU1]', 'URS)[URS]', 'EUN)[EUN]',
       'OAR)[OAR]', 'ROC)[ROC]', 'SAM)', 'LCA)', 'SMR)', 'KSA)', 'SEN)',
       'SRB)[SRB]', 'SCG)[YUG/SCG]', 'SGP)', 'SVK)[SVK]', 'SLO)', 'RSA)',
       'ESP)[Z]', 'SRI)[SRI]', 'SUD)', 'SUR)[E]', 'SWE)[Z]', 'SUI)',
       'SYR)', 'TPE)[TPE][TPE2]', 'TJK)', 'TAN)[TAN]', 'THA)', 'TOG)',
       'TGA)', 'TTO)[TTO]', 'TUN)', 'TUR)', 'TKM)', 'UGA)', 'UKR)',
       'UAE)', 'USA)[P][Q][R][Z][F]', 'URU)', 'UZB)', 'VEN)', 'VIE)',
       'ISV)', 'YUG)[YUG to 1992]', 'ZAM)[ZAM]', 'ZIM)[ZIM]', 'AIN)[AIN]',
       'IOA)[IOA]', 'IOP)[IOP]', 'ZZX)[ZZX]'], dtype=object)

array(['AFG', 'ALB', 'ALG', 'ARG', 'ARM', 'ANZ[ANZ]', 'AUS[AUS][Z]',
       'AUT', 'AZE', 'BAH', 'BRN', 'BAR[BAR]', 'BLR', 'BEL', 'BER',
       'BOH[BOH][Z]', 'BOT', 'BRA', 'BWI[BWI]', 'BUL[H]', 'BUR', 'BDI',
       'CMR', 'CAN', 'CPV', 'CHI[I]', 'CHN[CHN]', 'COL', 'CRC',
       'CIV[CIV]', 'CRO', 'CUB[Z]', 'CYP', 'CZE[CZE]', 'TCH[TCH]',
       'DEN[Z]', 'DJI[B]', 'DMA', 'DOM', 'ECU', 'EGY[EGY][Z]', 'ERI',
       'EST', 'ETH', 'FIJ', 'FIN', 'FRA[O][P][Z]', 'GAB', 'GEO',
       'GER[GER] [Z]', 'EUA[EUA]', 'GDR[GDR]', 'FRG[FRG]', 'GHA[GHA]',
       'GBR[GBR][Z]', 'GRE', 'GRN', 'GUA', 'GUY[GUY]', 'HAI[J]',
       'HKG[HKG]', 'HUN', 'ISL', 'IND[F]', 'INA', 'IRI[K]', 'IRQ', 'IRL',
       'ISR', 'ITA[M][S]', 'JAM[JAM]', 'JPN', 'JOR', 'KAZ', 'KEN', 'KOS',
       'PRK', 'KOR', 'KUW', 'KGZ', 'LAT', 'LBN', 'LIE', 'LTU', 'LUX[O]',
       'MAS[MAS]', 'MRI', 'MEX', 'MDA', 'MGL', 'MNE', 'MAR', 'MOZ', 'NAM',
       'NED[Z]', 'AHO[AHO][I]', 'NZL[NZL]', 'NIG', 'NGR', 'MKD', 'NOR[Q]',
       'PAK', 'PAN', 'PAR', 'PER[L]', 'PHI', 'POL', 'POR', 'PUR', 'QAT',
       'EOR', 'ROU', 'RUS[RUS]', 'RU1[RU1]', 'URS[URS]', 'EUN[EUN]',
       'OAR[OAR]', 'ROC[ROC]', 'SAM', 'LCA', 'SMR', 'KSA', 'SEN',
       'SRB[SRB]', 'SCG[YUG/SCG]', 'SGP', 'SVK[SVK]', 'SLO', 'RSA',
       'ESP[Z]', 'SRI[SRI]', 'SUD', 'SUR[E]', 'SWE[Z]', 'SUI', 'SYR',
       'TPE[TPE][TPE2]', 'TJK', 'TAN[TAN]', 'THA', 'TOG', 'TGA',
       'TTO[TTO]', 'TUN', 'TUR', 'TKM', 'UGA', 'UKR', 'UAE',
       'USA[P][Q][R][Z][F]', 'URU', 'UZB', 'VEN', 'VIE', 'ISV',
       'YUG[YUG to 1992]', 'ZAM[ZAM]', 'ZIM[ZIM]', 'AIN[AIN]', 'IOA[IOA]',
       'IOP[IOP]', 'ZZX[ZZX]'], dtype=object)

In [12]:
#drop extra text from IOC code column
df1['IOCcode'] = df1['IOCcode'].str[:3]
#check values on IOCcode
df1['IOCcode'].unique()

array(['AFG', 'ALB', 'ALG', 'ARG', 'ARM', 'ANZ', 'AUS', 'AUT', 'AZE',
       'BAH', 'BRN', 'BAR', 'BLR', 'BEL', 'BER', 'BOH', 'BOT', 'BRA',
       'BWI', 'BUL', 'BUR', 'BDI', 'CMR', 'CAN', 'CPV', 'CHI', 'CHN',
       'COL', 'CRC', 'CIV', 'CRO', 'CUB', 'CYP', 'CZE', 'TCH', 'DEN',
       'DJI', 'DMA', 'DOM', 'ECU', 'EGY', 'ERI', 'EST', 'ETH', 'FIJ',
       'FIN', 'FRA', 'GAB', 'GEO', 'GER', 'EUA', 'GDR', 'FRG', 'GHA',
       'GBR', 'GRE', 'GRN', 'GUA', 'GUY', 'HAI', 'HKG', 'HUN', 'ISL',
       'IND', 'INA', 'IRI', 'IRQ', 'IRL', 'ISR', 'ITA', 'JAM', 'JPN',
       'JOR', 'KAZ', 'KEN', 'KOS', 'PRK', 'KOR', 'KUW', 'KGZ', 'LAT',
       'LBN', 'LIE', 'LTU', 'LUX', 'MAS', 'MRI', 'MEX', 'MDA', 'MGL',
       'MNE', 'MAR', 'MOZ', 'NAM', 'NED', 'AHO', 'NZL', 'NIG', 'NGR',
       'MKD', 'NOR', 'PAK', 'PAN', 'PAR', 'PER', 'PHI', 'POL', 'POR',
       'PUR', 'QAT', 'EOR', 'ROU', 'RUS', 'RU1', 'URS', 'EUN', 'OAR',
       'ROC', 'SAM', 'LCA', 'SMR', 'KSA', 'SEN', 'SRB', 'SCG', 'SGP',
       'SVK', 'SLO', 'RSA', 'ESP', 'SRI', 'SUD', 'SUR', 'SWE', 'SUI',
       'SYR', 'TPE', 'TJK', 'TAN', 'THA', 'TOG', 'TGA', 'TTO', 'TUN',
       'TUR', 'TKM', 'UGA', 'UKR', 'UAE', 'USA', 'URU', 'UZB', 'VEN',
       'VIE', 'ISV', 'YUG', 'ZAM', 'ZIM', 'AIN', 'IOA', 'IOP', 'ZZX'],
      dtype=object)

In [13]:
#working on Summer columns
Summer = df['Summer Olympic Games']
#type of Summer
type(Summer)
#name of columns in Summer
Summer.columns
#number of rows and columns in Summer
Summer.shape
#get first 5 rows of Summer
Summer.head()
#add Summer to df1
df1 = pd.concat([df1,Summer], axis=1)
#rename Summer columns in df1 
df1.rename(columns={'No.' : 'Games_summer', 
                       'Unnamed: 2_level_1' : 'Gold_summer',
                         'Unnamed: 3_level_1' : 'Silver_summer', 
                         'Unnamed: 4_level_1':'Bronze_summer',
       'Unnamed: 5_level_1':'Total_summer'}, inplace = True)
#check columns in df1
df1.columns

pandas.core.frame.DataFrame

Index(['No.', 'Unnamed: 2_level_1', 'Unnamed: 3_level_1', 'Unnamed: 4_level_1',
       'Unnamed: 5_level_1'],
      dtype='object')

(162, 5)

,No.,Unnamed: 2_level_1,Unnamed: 3_level_1,Unnamed: 4_level_1,Unnamed: 5_level_1
0,16,0,0,2,2
1,10,0,0,2,2
2,15,7,4,9,20
3,26,22,27,31,80
4,8,2,11,9,22

Index(['Team (IOC code)', 'Team', 'IOCcode', 'Games_summer', 'Gold_summer',
       'Silver_summer', 'Bronze_summer', 'Total_summer'],
      dtype='object')

In [14]:
#working on Winter columns
Winter = df['Winter Olympic Games']
#type of Winter
type(Winter)
#columns in Winter
Winter.columns
#number of rows and columns
Winter.shape
#first 5 rows in Winter
Winter.head()
#add Winter to df1
df1 = pd.concat([df1,Winter], axis=1)
#rename Winter columns in df1
df1.rename(columns={'No.' : 'Games_winter', 
                       'Unnamed: 7_level_1' : 'Gold_winter',
                         'Unnamed: 8_level_1' : 'Silver_winter', 
                         'Unnamed: 9_level_1':'Bronze_winter',
       'Unnamed: 10_level_1':'Total_winter'}, inplace = True)
#check columns
df1.columns

pandas.core.frame.DataFrame

Index(['No.', 'Unnamed: 7_level_1', 'Unnamed: 8_level_1', 'Unnamed: 9_level_1',
       'Unnamed: 10_level_1'],
      dtype='object')

(162, 5)

,No.,Unnamed: 7_level_1,Unnamed: 8_level_1,Unnamed: 9_level_1,Unnamed: 10_level_1
0,0,0,0,0,0
1,5,0,0,0,0
2,3,0,0,0,0
3,20,0,0,0,0
4,8,0,0,0,0

Index(['Team (IOC code)', 'Team', 'IOCcode', 'Games_summer', 'Gold_summer',
       'Silver_summer', 'Bronze_summer', 'Total_summer', 'Games_winter',
       'Gold_winter', 'Silver_winter', 'Bronze_winter', 'Total_winter'],
      dtype='object')

In [15]:
#working on Combined total columns
Combo = df['Combined total']
#type of Combo
type(Combo)
#columns in Combo
Combo.columns
#number of rows and columns
Combo.shape
#first few rows of Combo
Combo.head()
#add Combo columns to df1
df1 = pd.concat([df1,Combo], axis=1)
#rename Combo columns 
df1.rename(columns={'No.' : 'Games_total', 
                       'Unnamed: 12_level_1' : 'Gold_total',
                         'Unnamed: 13_level_1' : 'Silver_total', 
                         'Unnamed: 14_level_1':'Bronze_total',
       'Unnamed: 15_level_1':'Totalmedals'}, inplace = True)
#check columns
df1.columns

pandas.core.frame.DataFrame

Index(['No.', 'Unnamed: 12_level_1', 'Unnamed: 13_level_1',
       'Unnamed: 14_level_1', 'Unnamed: 15_level_1'],
      dtype='object')

(162, 5)

,No.,Unnamed: 12_level_1,Unnamed: 13_level_1,Unnamed: 14_level_1,Unnamed: 15_level_1
0,16,0,0,2,2
1,15,0,0,2,2
2,18,7,4,9,20
3,46,22,27,31,80
4,16,2,11,9,22

Index(['Team (IOC code)', 'Team', 'IOCcode', 'Games_summer', 'Gold_summer',
       'Silver_summer', 'Bronze_summer', 'Total_summer', 'Games_winter',
       'Gold_winter', 'Silver_winter', 'Bronze_winter', 'Total_winter',
       'Games_total', 'Gold_total', 'Silver_total', 'Bronze_total',
       'Totalmedals'],
      dtype='object')

In [16]:
#information about dataframe
df1.info()
#number of rows and columns
df1.shape
#first row of dataframe
df1.head(1)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 162 entries, 0 to 161
Data columns (total 18 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Team (IOC code)  162 non-null    object
 1   Team             162 non-null    object
 2   IOCcode          162 non-null    object
 3   Games_summer     162 non-null    int64
 4   Gold_summer      162 non-null    int64
 5   Silver_summer    162 non-null    int64
 6   Bronze_summer    162 non-null    int64
 7   Total_summer     162 non-null    int64
 8   Games_winter     162 non-null    int64
 9   Gold_winter      162 non-null    int64
 10  Silver_winter    162 non-null    int64
 11  Bronze_winter    162 non-null    int64
 12  Total_winter     162 non-null    int64
 13  Games_total      162 non-null    int64
 14  Gold_total       162 non-null    int64
 15  Silver_total     162 non-null    int64
 16  Bronze_total     162 non-null    int64
 17  Totalmedals      162 non-null    int64
dtypes: int64(15), object(3)
memory usage: 22.9+ KB

(162, 18)

,Team (IOC code),Team,IOCcode,Games_summer,Gold_summer,Silver_summer,Bronze_summer,Total_summer,Games_winter,Gold_winter,Silver_winter,Bronze_winter,Total_winter,Games_total,Gold_total,Silver_total,Bronze_total,Totalmedals
0,Afghanistan (AFG),Afghanistan,AFG,16,0,0,2,2,0,0,0,0,0,16,0,0,2,2